public/uploads/bill_files/21/2017-12-06T20:57:46-DCA8603175G2/request.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://facturacion.finkok.com/stamp" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="apps.services.soap.core.views"><env:Body><tns:sign_stamp><tns:xml>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPGNmZGk6
Q29tcHJvYmFudGUgeG1sbnM6Y2ZkaT0iaHR0cDovL3d3dy5zYXQuZ29iLm14
L2NmZC8zIiB4bWxuczp4c2k9Imh0dHA6Ly93d3cudzMub3JnLzIwMDEvWE1M
U2NoZW1hLWluc3RhbmNlIiB4c2k6c2NoZW1hTG9jYXRpb249Imh0dHA6Ly93
d3cuc2F0LmdvYi5teC9jZmQvMyBodHRwOi8vd3d3LnNhdC5nb2IubXgvc2l0
aW9faW50ZXJuZXQvY2ZkLzMvY2ZkdjMzLnhzZCIgVmVyc2lvbj0iMy4zIiBT
ZXJpZT0iQVUiIEZvbGlvPSIyIiBGZWNoYT0iMjAxNy0xMi0wNlQyMDo1Nzo0
NiIgU2VsbG89IiIgRm9ybWFQYWdvPSIwMyIgTm9DZXJ0aWZpY2Fkbz0iMjAw
MDEwMDAwMDAzMDAwMjI4MTUiIENlcnRpZmljYWRvPSIiIENvbmRpY2lvbmVz
RGVQYWdvPSJDb250YWRvIiBTdWJUb3RhbD0iMjE5My44MCIgRGVzY3VlbnRv
PSI4Ny41OSIgTW9uZWRhPSJNWE4iIFRpcG9DYW1iaW89IjEiIFRvdGFsPSIy
NDQzLjIwIiBUaXBvRGVDb21wcm9iYW50ZT0iSSIgTWV0b2RvUGFnbz0iUFVF
IiBMdWdhckV4cGVkaWNpb249IjQ1MDEwIj4KICA8Y2ZkaTpFbWlzb3IgUmZj
PSJMQU43MDA4MTczUjUiIE5vbWJyZT0iQ0lOREVNRVggU0EgREUgQ1YiIFJl
Z2ltZW5GaXNjYWw9IjYwMSIvPgogIDxjZmRpOlJlY2VwdG9yIFJmYz0iRENB
ODYwMzE3NUcyIiBOb21icmU9ImJpb2Zhc2UiIFVzb0NGREk9IkcwMSIvPgog
IDxjZmRpOkNvbmNlcHRvcz4KICAgIDxjZmRpOkNvbmNlcHRvIENsYXZlUHJv
ZFNlcnY9IjE0MTIxNTAwIiBOb0lkZW50aWZpY2FjaW9uPSIyMDAzIiBDYW50
aWRhZD0iMTAiIENsYXZlVW5pZGFkPSJIODciIFVuaWRhZD0iUGllemEiIERl
c2NyaXBjaW9uPSJDb3JyZWNham9uIGdyYW5kZSAyM3gyM3gxNS41IiBWYWxv
clVuaXRhcmlvPSI0NC4yMCIgSW1wb3J0ZT0iNDQyLjAwIj4KICAgICAgPGNm
ZGk6SW1wdWVzdG9zPgogICAgICAgIDxjZmRpOlRyYXNsYWRvcz4KICAgICAg
ICAgIDxjZmRpOlRyYXNsYWRvIEJhc2U9IjQ0Mi4wMCIgSW1wdWVzdG89IjAw
MiIgVGlwb0ZhY3Rvcj0iVGFzYSIgVGFzYU9DdW90YT0iMC4xNjAwMDAiIElt
cG9ydGU9IjcwLjcyIi8+CiAgICAgICAgPC9jZmRpOlRyYXNsYWRvcz4KICAg
ICAgPC9jZmRpOkltcHVlc3Rvcz4KICAgIDwvY2ZkaTpDb25jZXB0bz4KICAg
IDxjZmRpOkNvbmNlcHRvIENsYXZlUHJvZFNlcnY9IjE0MTIxNTAwIiBOb0lk
ZW50aWZpY2FjaW9uPSIxOTA1IiBDYW50aWRhZD0iMTAiIENsYXZlVW5pZGFk
PSJIODciIFVuaWRhZD0iUGllemEiIERlc2NyaXBjaW9uPSJFY29idXJvIGNv
bWJvIGdyYW5kZSA0IGNham9uZXMgMzh4MzN4NjMiIFZhbG9yVW5pdGFyaW89
IjE3NS4xOCIgSW1wb3J0ZT0iMTc1MS44MCIgRGVzY3VlbnRvPSI4Ny41OSI+
CiAgICAgIDxjZmRpOkltcHVlc3Rvcz4KICAgICAgICA8Y2ZkaTpUcmFzbGFk
b3M+CiAgICAgICAgICA8Y2ZkaTpUcmFzbGFkbyBCYXNlPSIxNjY0LjIxIiBJ
bXB1ZXN0bz0iMDAyIiBUaXBvRmFjdG9yPSJUYXNhIiBUYXNhT0N1b3RhPSIw
LjE2MDAwMCIgSW1wb3J0ZT0iMjY2LjI3Ii8+CiAgICAgICAgPC9jZmRpOlRy
YXNsYWRvcz4KICAgICAgPC9jZmRpOkltcHVlc3Rvcz4KICAgIDwvY2ZkaTpD
b25jZXB0bz4KICA8L2NmZGk6Q29uY2VwdG9zPgogIDxjZmRpOkltcHVlc3Rv
cyBUb3RhbEltcHVlc3Rvc1RyYXNsYWRhZG9zPSIzMzYuOTkiPgogICAgPGNm
ZGk6VHJhc2xhZG9zPgogICAgICA8Y2ZkaTpUcmFzbGFkbyBJbXB1ZXN0bz0i
MDAyIiBUaXBvRmFjdG9yPSJUYXNhIiBUYXNhT0N1b3RhPSIwLjE2MDAwMCIg
SW1wb3J0ZT0iMzM2Ljk5Ii8+CiAgICA8L2NmZGk6VHJhc2xhZG9zPgogIDwv
Y2ZkaTpJbXB1ZXN0b3M+CjwvY2ZkaTpDb21wcm9iYW50ZT4K
</tns:xml><tns:username>favio.velez@hotmail.com</tns:username><tns:password>Plata353909$</tns:password></tns:sign_stamp></env:Body></env:Envelope>