public/uploads/bill_files/21/2017-12-06T21:09:53-DCA8603175G2/request.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://facturacion.finkok.com/stamp" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="apps.services.soap.core.views"><env:Body><tns:sign_stamp><tns:xml>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPGNmZGk6
Q29tcHJvYmFudGUgeG1sbnM6Y2ZkaT0iaHR0cDovL3d3dy5zYXQuZ29iLm14
L2NmZC8zIiB4bWxuczp4c2k9Imh0dHA6Ly93d3cudzMub3JnLzIwMDEvWE1M
U2NoZW1hLWluc3RhbmNlIiB4c2k6c2NoZW1hTG9jYXRpb249Imh0dHA6Ly93
d3cuc2F0LmdvYi5teC9jZmQvMyBodHRwOi8vd3d3LnNhdC5nb2IubXgvc2l0
aW9faW50ZXJuZXQvY2ZkLzMvY2ZkdjMzLnhzZCIgVmVyc2lvbj0iMy4zIiBT
ZXJpZT0iTkMwMjEiIEZvbGlvPSI0IiBGZWNoYT0iMjAxNy0xMi0wNlQyMTow
OTo1MyIgU2VsbG89IiIgRm9ybWFQYWdvPSIwMyIgTm9DZXJ0aWZpY2Fkbz0i
MjAwMDEwMDAwMDAzMDAwMjI4MTUiIENlcnRpZmljYWRvPSIiIENvbmRpY2lv
bmVzRGVQYWdvPSJDb250YWRvIiBTdWJUb3RhbD0iMzQ0LjgzIiBNb25lZGE9
Ik1YTiIgVGlwb0NhbWJpbz0iMSIgVG90YWw9IjQwMC4wMCIgVGlwb0RlQ29t
cHJvYmFudGU9IkUiIE1ldG9kb1BhZ289IlBVRSIgTHVnYXJFeHBlZGljaW9u
PSI0NTAxMCI+CiAgPGNmZGk6Q2ZkaVJlbGFjaW9uYWRvcyBUaXBvUmVsYWNp
b249IjAxIj4KICAgIDxjZmRpOkNmZGlSZWxhY2lvbmFkbyBVVUlEPSJDRjM2
ODU0My02NTE1LTRGRDktQTEzMS1GMzAwQzlGQzgxOUQiLz4KICA8L2NmZGk6
Q2ZkaVJlbGFjaW9uYWRvcz4KICA8Y2ZkaTpFbWlzb3IgUmZjPSJMQU43MDA4
MTczUjUiIE5vbWJyZT0iQ0lOREVNRVggU0EgREUgQ1YiIFJlZ2ltZW5GaXNj
YWw9IjYwMSIvPgogIDxjZmRpOlJlY2VwdG9yIFJmYz0iRENBODYwMzE3NUcy
IiBOb21icmU9ImJpb2Zhc2UiIFVzb0NGREk9IkcwMiIvPgogIDxjZmRpOkNv
bmNlcHRvcz4KICAgIDxjZmRpOkNvbmNlcHRvIENsYXZlUHJvZFNlcnY9Ijg0
MTExNTA2IiBDYW50aWRhZD0iMSIgQ2xhdmVVbmlkYWQ9IkFDVCIgVW5pZGFk
PSJBY3RpdmlkYWQiIERlc2NyaXBjaW9uPSJEZXNjdWVudG8gZGVsIDE2LjM3
JSIgVmFsb3JVbml0YXJpbz0iMzQ0LjgzIiBJbXBvcnRlPSIzNDQuODMiPgog
ICAgICA8Y2ZkaTpJbXB1ZXN0b3M+CiAgICAgICAgPGNmZGk6VHJhc2xhZG9z
PgogICAgICAgICAgPGNmZGk6VHJhc2xhZG8gQmFzZT0iMzQ0LjgzIiBJbXB1
ZXN0bz0iMDAyIiBUaXBvRmFjdG9yPSJUYXNhIiBUYXNhT0N1b3RhPSIwLjE2
MDAwMCIgSW1wb3J0ZT0iNTUuMTciLz4KICAgICAgICA8L2NmZGk6VHJhc2xh
ZG9zPgogICAgICA8L2NmZGk6SW1wdWVzdG9zPgogICAgPC9jZmRpOkNvbmNl
cHRvPgogIDwvY2ZkaTpDb25jZXB0b3M+CiAgPGNmZGk6SW1wdWVzdG9zIFRv
dGFsSW1wdWVzdG9zVHJhc2xhZGFkb3M9IjU1LjE3Ij4KICAgIDxjZmRpOlRy
YXNsYWRvcz4KICAgICAgPGNmZGk6VHJhc2xhZG8gSW1wdWVzdG89IjAwMiIg
VGlwb0ZhY3Rvcj0iVGFzYSIgVGFzYU9DdW90YT0iMC4xNjAwMDAiIEltcG9y
dGU9IjU1LjE3Ii8+CiAgICA8L2NmZGk6VHJhc2xhZG9zPgogIDwvY2ZkaTpJ
bXB1ZXN0b3M+CjwvY2ZkaTpDb21wcm9iYW50ZT4K
</tns:xml><tns:username>favio.velez@hotmail.com</tns:username><tns:password>Plata353909$</tns:password></tns:sign_stamp></env:Body></env:Envelope>