factupid/console/templates/soap_request/stamp.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
	<Body>
		<stamp xmlns="http://facturacion.finkok.com/stamp">
			<xml>{{ xml }}</xml>
			<username>{{ username }}</username>
			<password>{{ password }}</password>
		</stamp>
	</Body>
</Envelope>